-*- coding: utf-8 -*-
#+STARTUP: showeverything indent
korean-hanguel
latin-1-prefix
ἀ῏εἒ greek
hebrew
맥북 ἀ῏εἒ 보다 범용적으로 사용가능한 이맥스로 입력의 방식을 통일하는 것이 더 효율적인 선택이라고 판단한다.

 file:insert-char.org file:coding_system_in_emacs.org
latin-1 입력법을 발견함! - 라틴어 입력을 맥북에 의존하기 보다는 범용사용을 가능하게 익히는 것이 유리하다.
help:set-input-method C-x RET C-\ latin-1-prefix  
äª (set-input-method 'korean-hangul) (set-input-method "latin-1-prefix") (set-input-method "TeX")
help:describe-input-method
(describe-input-method 'latin-1-prefix  ) (describe-input-method "TeX") =>  file:insert-char.org => [[file:insert-char.org::*TeX%20and%20latin-1-prefix][TeX and latin-1-prefix]]
- (매우상세한) 키값 알아내기(C-u) C-x = 
(describe-key (kbd "C-h m"))
                  (kbd "C-h m") => "m" 

    [해결함] # 반드시 영어로 입력할 것 한글은 깨진다. # 이었으나, 

키보드 자판익힘
QWERT YUIOP
ASDFG HJKL;
ZXCVB NM,./
CsM

ㅂㅈㄷㄱㅅ ㅛㅕㅑㅐㅔ
ㅁㄴㅇㄹㅎ ㅗㅓㅏㅣ;
ㅋㅌㅊㅍㅠ ㅜㅡ, ./
그리스어의 화면을 붙여서 만든 글자를 확대해서 그림으로 보낸다음, 바탕화면에 보낸다.
자판을 익히는 것에 큰 도움이 될 것이다.


(describe-input-method 'korean-hangul) 
(describe-input-method "greek")
(describe-input-method "greek-babel")
(describe-input-method "greek-ibycus4")
(describe-input-method "latin-1-prefix")
(describe-input-method "greek-jis")
(describe-input-method "greek-mizuochi")
(describe-input-method "greek-postfix")
;;사진을 촬영하였으니 확인해 볼 것.
(set-input-method 'korean-hangul) 
(set-input-method "greek-babel") `` ᾽ `` `` {``} {᾽} {``} {᾽}᾽᾽᾽``````````
(set-input-method "greek-ibycus4") ”σσς ς ϝϜϜϜᾕ———————— “ ᾅψψψθθθξξκαβγδεζθηικλμνξοπρστυφχψω ” 
(set-input-method "latin-1-prefix")
αβvιεθδιεθσιεηιυη·π·πα·αἁιαδφασδφασδφασδadfasdfασδφasfd
greek
greek-babel
greek-ibycus4
greek-jis
greek-mizuochi
greek-postfix

* 
#+BEGIN_SRC sh
echo "한글이 나온다"

#+END_SRC

#+RESULTS:
: 한글이 나온다

